{
  "backend/main.mo": "Motoko canister implementing submissions, blob storage, and access‑controlled user/admin APIs with profile management and media uploads.",
  "feature_evidence.json": "Report mapping features to source files, components, and test IDs for frontend upload flow and media‑policy alignment.",
  "frontend-file-summaries.txt": "List of concise summaries for each frontend file covering components, hooks, pages, and utilities.",
  "frontend/index.css": "Tailwind CSS base configuration defining design tokens, themes, and global styles.",
  "frontend/index.html": "Root HTML document bootstrapping the React app with favicon, metadata, and main script.",
  "frontend/README.md": "Frontend overview describing features, admin login details, tech stack, and project structure.",
  "frontend/src/App.tsx": "Defines TanStack Router routes, admin‑guarded pages, and global providers like ThemeProvider and Toaster.",
  "frontend/src/components/admin/AdminAudioDownloadButton.tsx": "Button for admins to download audio blobs by fetching bytes, generating a file, and triggering a download.",
  "frontend/src/components/admin/AdminAudioPlayer.tsx": "Admin audio player that streams audio via a direct URL with loading and error states.",
  "frontend/src/components/admin/AdminMediaDownloadButton.tsx": "Generic admin download button for audio or video blobs with MIME detection and toast notifications.",
  "frontend/src/components/admin/AdminVideoPlayer.tsx": "Admin video player that streams video via a direct URL with loading and error handling.",
  "frontend/src/components/admin/DeleteSubmissionButton.tsx": "Admin delete button showing a confirmation dialog and executing submission deletion with navigation and toasts.",
  "frontend/src/components/admin/ExportTools.tsx": "Provides CSV export functionality for submissions and a placeholder ZIP export button using a UI card layout.",
  "frontend/src/components/AdminRouteGuard.tsx": "Component that checks admin session state and blocks or redirects unauthorized users.",
  "frontend/src/components/AppShell.tsx": "Layout component providing header, navigation, footer, and conditional rendering for authenticated admin users and the success page.",
  "frontend/src/components/AudioRecorder.tsx": "In-browser audio recorder with pause, resume, stop, duration tracking, and file attachment, with auto-stop and error handling.",
  "frontend/src/components/LocalCaptchaChallenge.tsx": "Simple math‑based CAPTCHA component that validates user input and triggers success or fail callbacks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useAudioRecorder.ts": "Implements audio recording with MediaRecorder, tracking state, timing, errors, and producing a recorded Blob.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for Internet Identity authentication, login flow, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, submissions, and admin session management using the backend actor and admin API.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes, defining color and layout tokens.",
  "frontend/src/lib/adminApi.ts": "Implements client-side admin auth with hardcoded credentials, constant‑time comparison, and sessionStorage-backed sessions.",
  "frontend/src/lib/adminAuth.ts": "Empty placeholder module for admin auth logic.",
  "frontend/src/lib/adminSession.ts": "Empty file reserved for admin session handling.",
  "frontend/src/lib/audioValidation.ts": "Defines allowed audio formats and size limits and provides functions to validate audio files and format size/duration values.",
  "frontend/src/lib/csrf.ts": "Provides simple sessionStorage-based CSRF token storage and helper to attach the token to request headers.",
  "frontend/src/lib/downloads.ts": "Implements utilities to trigger file downloads from a Blob or URL using a temporary anchor element.",
  "frontend/src/lib/safeText.ts": "Provides text sanitization, truncation, and HTML-escaping helpers.",
  "frontend/src/lib/submissionFormat.ts": "Formats timestamps, file sizes, durations, and submission IDs, and generates random submission IDs.",
  "frontend/src/lib/videoValidation.ts": "Contains deprecated video validation logic with allowed formats, size checks, and a helper for formatting file size.",
  "frontend/src/main.tsx": "Renders the React app root with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Loads, filters, sorts, and displays all submissions for admins and includes search and export tools.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Implements an admin login form with credential validation and error handling before redirecting to the dashboard.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Admin UI for viewing and updating settings such as CAPTCHA and upload size limits, with save actions calling update hooks and showing placeholders for unimplemented backend logic.",
  "frontend/src/pages/admin/AuditLogPage.tsx": "Displays audit log filters and table, fetching log entries via query hooks and noting backend audit tracking is not yet implemented.",
  "frontend/src/pages/admin/SubmissionDetailsPage.tsx": "Loads and displays full details for a single submission including media playback, metadata, timestamps, and delete actions.",
  "frontend/src/pages/StudentUploadPage.tsx": "Handles student audio submission with form inputs, audio validation, optional captcha, and upload progress tracking.",
  "frontend/src/pages/SubmissionSuccessPage.tsx": "Displays a simple confirmation message after a successful submission.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning sensitive parameters from the hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin setup for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current app state, architecture notes, known issues, and existing features for the AudioDrop system."
}