{
  "backend/main.mo": "Main Motoko backend actor defining submission types, access control, storage mixins, health endpoints, user profiles, and submission management logic.",
  "backend/migration.mo": "Migration module converting old actor state to new format by dropping session data while preserving submissions, profiles, and counters.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend/backend features, affected files, components, and associated requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend source files.",
  "frontend/FFMPEG_SETUP.md": "Empty placeholder file intended for future FFmpeg setup instructions.",
  "frontend/index.css": "Global Tailwind CSS configuration defining color variables, themes, and base styling for light and dark modes.",
  "frontend/index.html": "Base HTML template that loads the React frontend and mounts it into the root element.",
  "frontend/README.md": "Frontend documentation outlining features, architecture, security model, admin flow, and development setup.",
  "frontend/src/App.tsx": "Main React router configuration defining all public and admin routes wrapped in the app shell and theme provider.",
  "frontend/src/backend.did.ts": "Defines Candid IDL types and service interface for backend calls including submissions, admin actions, user profiles, and media handling.",
  "frontend/src/components/admin/AdminAudioDownloadButton.tsx": "Downloads audio blobs with inferred or provided MIME types and handles loading state.",
  "frontend/src/components/admin/AdminAudioPlayer.tsx": "Streams and plays admin audio blobs with loading and error handling.",
  "frontend/src/components/admin/AdminMediaDownloadButton.tsx": "Downloads audio or video blobs with MIME type inference and dynamic filenames.",
  "frontend/src/components/admin/AdminSubmissionDownloadButton.tsx": "Button component that triggers backend submission download and shows loading and error states.",
  "frontend/src/components/admin/AdminVideoPlayer.tsx": "Loads a video blob URL for admin playback with loading and error handling inside a card UI.",
  "frontend/src/components/admin/DeleteSubmissionButton.tsx": "Confirmation dialog and button to delete a submission using a mutation and then navigate away.",
  "frontend/src/components/admin/ExportTools.tsx": "Provides CSV export of submission metadata and a placeholder ZIP export action.",
  "frontend/src/components/AdminRouteGuard.tsx": "A route guard that checks admin status and redirects or blocks access with UI feedback.",
  "frontend/src/components/AppShell.tsx": "Provides the main layout with header, footer, navigation, and admin-specific links, hiding them on the success page.",
  "frontend/src/components/AudioRecorder.tsx": "Implements an in-browser audio recorder with preview, duration limits, error handling, and file export.",
  "frontend/src/components/LocalCaptchaChallenge.tsx": "Renders a simple math CAPTCHA requiring correct input before proceeding.",
  "frontend/src/dev/ffmpegSmoke.ts": "Empty placeholder file for ffmpeg-related development tests.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and invalidates queries when it changes.",
  "frontend/src/hooks/useAudioRecorder.ts": "Custom hook handling audio recording, pause/resume, timing, mime selection, and blob output.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity login, storing identity state and exposing auth helpers.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles and submissions, wrapping backend actor calls with error handling.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes, applying base background, text, and border styles.",
  "frontend/src/lib/adminApi.ts": "Provides admin authentication helpers for login, logout, and session checks using a backend actor and sessionStorage.",
  "frontend/src/lib/adminAuth.ts": "Empty placeholder file for future admin auth logic.",
  "frontend/src/lib/adminDownloads.ts": "Implements admin-only submission download logic, fetching MP3 data from the backend and triggering a browser download.",
  "frontend/src/lib/adminSession.ts": "Empty placeholder file for admin session utilities.",
  "frontend/src/lib/audio/audioDecodeErrors.ts": "Defines custom audio error classes and helpers for identifying and formatting audio decoding and conversion errors.",
  "frontend/src/lib/audio/convertBlobToMp3.ts": "Provides client-side recorded-audio-to-MP3 conversion using Web Audio API and lamejs, with progress reporting.",
  "frontend/src/lib/audioValidation.ts": "Validates audio files for size, extension, and MIME type, and includes helpers for formatting file size and duration.",
  "frontend/src/lib/csrf.ts": "Implements simple CSRF token storage and header attachment using sessionStorage.",
  "frontend/src/lib/downloads.ts": "Contains generic helpers for downloading blobs or URLs through browser-triggered downloads.",
  "frontend/src/lib/ffmpeg/convertToMp3.ts": "Empty placeholder file for future FFmpeg-based MP3 conversion.",
  "frontend/src/lib/icActor.ts": "Initializes and caches a DFINITY backend actor with environment-based canister config and optional identity support.",
  "frontend/src/lib/mediaMime.ts": "Provides MIME type normalization and utilities to map between MIME types and file extensions, infer types, and generate safe filenames.",
  "frontend/src/lib/safeText.ts": "Contains text sanitization, truncation, and HTML escaping helpers.",
  "frontend/src/lib/submissionFormat.ts": "Formats timestamps, file sizes, durations, and submission IDs for display.",
  "frontend/src/lib/videoValidation.ts": "Deprecated video validation utilities for admins, including size and format checks.",
  "frontend/src/main.tsx": "Initializes React app with Internet Identity and React Query providers and renders the root component.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing searchable, sortable submissions with error handling and export tools.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Checks admin permissions on load and shows access status or denial message.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Provides UI for viewing and modifying admin settings like CAPTCHA and upload limits.",
  "frontend/src/pages/admin/AuditLogPage.tsx": "Renders an audit log page with client-side filtering for action type and date ranges, displaying entries fetched from useGetAuditLog. Shows alerts and tables with loading and empty states.",
  "frontend/src/pages/admin/SubmissionDetailsPage.tsx": "Fetches and displays full details for a specific submission, including media playback, metadata, timestamps, and deletion. Handles loading, errors, and navigation back to the dashboard.",
  "frontend/src/pages/StudentUploadPage.tsx": "Implements the student audio upload form with validation, recording, CAPTCHA, and submission handling.",
  "frontend/src/pages/SubmissionSuccessPage.tsx": "Displays a confirmation message after successful submission.",
  "frontend/src/types/lamejs.d.ts": "Provides TypeScript type definitions for the lamejs MP3 encoder exposed on the global window object.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, animations, plugins, and container settings for the frontend theme.",
  "project_state.json": "Describes project state and requirements focused on correct backend actor initialization, health checks, and fixing deployment issues where the frontend cannot reach the backend."
}