{
  "backend/main.mo": "Backend actor managing user profiles, access control, and media submissions with audio/video support, including creation, listing, and retrieval logic.",
  "backend/migration.mo": "Migration module converting old audio-only submissions to the new media format by mapping audio to media with default metadata.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to impacted frontend files, components, and test IDs for media upload and admin tooling updates.",
  "frontend-file-summaries.txt": "Collection of short descriptions for all frontend source files summarizing their roles in routing, validation, admin tools, and media handling.",
  "frontend/index.css": "Tailwind CSS setup defining base variables, theming, and global styles for both light and dark modes.",
  "frontend/index.html": "Base HTML entry point loading the React application and providing the root container and favicon.",
  "frontend/README.md": "Documentation outlining frontend features, user flows, admin tools, security requirements, and current backend gaps for the AudioDrop app.",
  "frontend/src/App.tsx": "Main React app configuring routes, theme provider, layout shell, and admin-guarded pages using TanStack Router.",
  "frontend/src/components/admin/AdminAudioDownloadButton.tsx": "Downloads an audio ExternalBlob as a WebM file with loading state and toast notifications.",
  "frontend/src/components/admin/AdminAudioPlayer.tsx": "Streams and plays audio via a direct URL with loading and error handling.",
  "frontend/src/components/admin/AdminMediaDownloadButton.tsx": "Downloads audio or video ExternalBlobs using the correct MIME type with status feedback.",
  "frontend/src/components/admin/AdminVideoPlayer.tsx": "Streams and plays video via a direct URL with loading and error handling.",
  "frontend/src/components/admin/DeleteSubmissionButton.tsx": "Shows a confirmation dialog and deletes a submission using a mutation, then navigates back with toast feedback.",
  "frontend/src/components/admin/ExportTools.tsx": "UI component providing CSV and ZIP export actions for submissions, using backend exports with a client-side CSV fallback.",
  "frontend/src/components/AdminRouteGuard.tsx": "Guards admin routes by checking authentication and admin status, redirecting or showing an access denied alert if needed.",
  "frontend/src/components/AppShell.tsx": "Defines the main app layout with navigation, admin controls, and logout handling based on route and authentication state.",
  "frontend/src/components/AudioRecorder.tsx": "Provides an in-browser audio recording interface with pause, resume, stop, and attach functionality, enforcing max duration.",
  "frontend/src/components/LocalCaptchaChallenge.tsx": "Implements a simple math-based CAPTCHA requiring correct input before proceeding.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useAudioRecorder.ts": "Custom hook implementing audio recording with MediaRecorder, including pause/resume, timers, and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login and logout utilities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend calls for profiles, submissions, admin checks, and settings updates.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light and dark theme color tokens.",
  "frontend/src/lib/adminSession.ts": "Utility for managing a placeholder admin session token in sessionStorage with expiry checks.",
  "frontend/src/lib/audioValidation.ts": "Defines allowed audio formats, size and duration limits, and helper functions for validating audio files and formatting size/duration.",
  "frontend/src/lib/csrf.ts": "Implements sessionStorage-based placeholder CSRF token storage and header attachment utilities.",
  "frontend/src/lib/downloads.ts": "Provides helpers to trigger browser downloads from blobs or URLs with error handling.",
  "frontend/src/lib/safeText.ts": "Contains text sanitization, truncation, and HTML escaping utilities.",
  "frontend/src/lib/submissionFormat.ts": "Formats timestamps, file sizes, durations, and generates and displays submission IDs.",
  "frontend/src/lib/videoValidation.ts": "Defines allowed video formats and size limits, and validates video files with size, MIME, and extension checks.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin interface for searching, sorting, and viewing submissions with export tools.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Handles admin authentication via Internet Identity and optional profile setup before accessing the dashboard.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Admin settings UI allowing toggling CAPTCHA and viewing upload limits, with save handling and loading states; backend support is required for actual persistence.",
  "frontend/src/pages/admin/AuditLogPage.tsx": "Audit log viewer with filters for action type and date range, showing entries fetched from the backend once implemented.",
  "frontend/src/pages/admin/SubmissionDetailsPage.tsx": "Shows detailed information for a specific submission, including metadata, media preview, download option, and delete controls.",
  "frontend/src/pages/StudentUploadPage.tsx": "UI and logic for students to upload audio or video submissions with validation, captcha, and form handling.",
  "frontend/src/pages/SubmissionSuccessPage.tsx": "Displays a confirmation message after a successful submission with navigation back home.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning sensitive params from the hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, container settings, and enabling typography, container query, and animation plugins.",
  "project_state.json": "No summary available."
}