{
  "backend/main.mo": "Motoko backend actor defining submission types, authorization, storage mixins, user profiles, and query/update endpoints for submissions and health checks.",
  "feature_evidence.json": "Feature evidence report listing tracked features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across components, hooks, and utilities.",
  "frontend/FFMPEG_SETUP.md": "Placeholder markdown file with no content.",
  "frontend/index.css": "Tailwind CSS base and theme variables defining light and dark color schemes and core styling.",
  "frontend/index.html": "HTML entry point bootstrapping the React application and loading main.tsx.",
  "frontend/README.md": "Frontend documentation outlining features, architecture, IC configuration, and key source files.",
  "frontend/src/App.tsx": "App router and root layout performing initial backend health checks and defining all student and admin routes.",
  "frontend/src/backend.did.ts": "Candid IDL definitions for the backend canister including types and service methods.",
  "frontend/src/components/admin/AdminAudioDownloadButton.tsx": "Allows admins to download audio blobs with inferred MIME type handling and filename generation.",
  "frontend/src/components/admin/AdminAudioPlayer.tsx": "Streams and plays audio from an ExternalBlob with loading and error states in an admin UI card.",
  "frontend/src/components/admin/AdminMediaDownloadButton.tsx": "Renders a download button that fetches bytes from an ExternalBlob, determines MIME type, builds a Blob, and triggers a file download with a generated filename.",
  "frontend/src/components/admin/AdminSubmissionDownloadButton.tsx": "Provides a button to download a submission via backend actor, showing loading state and toast notifications.",
  "frontend/src/components/admin/AdminVideoPlayer.tsx": "Loads a streaming URL from an ExternalBlob and displays a video player with loading and error states.",
  "frontend/src/components/admin/DeleteSubmissionButton.tsx": "Offers a confirmation dialog to delete a submission using a mutation hook and redirects on success.",
  "frontend/src/components/admin/ExportTools.tsx": "Exports submission metadata to CSV client‑side and provides a placeholder ZIP export action.",
  "frontend/src/components/AdminRouteGuard.tsx": "Guards admin routes by checking admin status, displaying loading or access denied screens, and rendering children when authorized.",
  "frontend/src/components/AppShell.tsx": "Defines the main app layout with header, footer, admin navigation, and conditional rendering for the success page.",
  "frontend/src/components/AudioRecorder.tsx": "Provides in-browser audio recording with preview, duration limits, error handling, and attachment of the final recording.",
  "frontend/src/components/CanisterIdBanner.tsx": "Displays a fixed banner showing the backend canister ID and whether it is valid.",
  "frontend/src/components/LocalCaptchaChallenge.tsx": "Implements a simple math-based CAPTCHA with regeneration and success/fail callbacks.",
  "frontend/src/components/RuntimeIcConfigDebug.tsx": "Shows runtime Internet Computer configuration details for debugging, including host and canister ID validity.",
  "frontend/src/config/canisters.ts": "Defines and validates the backend canister ID and exposes helpers for retrieving configuration status.",
  "frontend/src/dev/ffmpegSmoke.ts": "Empty placeholder file for ffmpeg-related development tests.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useAudioRecorder.ts": "Implements audio recording with MediaRecorder, tracking state, timing, supported MIME types, and producing a final audio Blob.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, identity loading, and authentication state using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend health checks, admin checks, and fetching submissions via the actor API.",
  "frontend/src/ic/actor.ts": "Creates and manages mainnet backend actors, including anonymous caching and a health check utility.",
  "frontend/src/ic/agent.ts": "Provides a mainnet-configured HttpAgent factory with optional identity and cached anonymous agent support.",
  "frontend/src/index.css": "Tailwind base and theme CSS defining light/dark mode color variables and global styling.",
  "frontend/src/lib/adminApi.ts": "Placeholder admin authentication API returning fallback responses since backend lacks admin endpoints.",
  "frontend/src/lib/adminAuth.ts": "Empty file with no implemented logic.",
  "frontend/src/lib/adminDownloads.ts": "Implements admin-only submission download logic by fetching MP3 bytes from backend and triggering a browser download.",
  "frontend/src/lib/adminSession.ts": "Empty file with no implemented logic.",
  "frontend/src/lib/audio/audioDecodeErrors.ts": "Defines custom audio error types and utilities for identifying and generating user-friendly audio decoding error messages.",
  "frontend/src/lib/audio/convertBlobToMp3.ts": "Provides utilities to detect MP3 support and convert recorded audio blobs to MP3 using Web Audio API and lamejs loaded from CDN.",
  "frontend/src/lib/audioValidation.ts": "Validates audio files by size, extension, and MIME type, and includes helpers to format file size and duration.",
  "frontend/src/lib/csrf.ts": "Implements placeholder CSRF token storage in sessionStorage and helpers to attach CSRF headers.",
  "frontend/src/lib/downloads.ts": "Helpers to trigger file downloads from blobs or URLs by programmatically creating anchor elements.",
  "frontend/src/lib/ffmpeg/convertToMp3.ts": "Empty placeholder file for future FFmpeg-based MP3 conversion.",
  "frontend/src/lib/icActor.ts": "Deprecated wrapper delegating backend actor creation and health checks to the shared actor factory.",
  "frontend/src/lib/mediaMime.ts": "Maps and normalizes MIME types and file extensions, and infers MIME types from metadata or filenames.",
  "frontend/src/lib/safeText.ts": "Provides simple text sanitization, truncation, and HTML escaping utilities.",
  "frontend/src/lib/submissionFormat.ts": "Formats timestamps, durations, and file sizes, and generates and displays submission IDs.",
  "frontend/src/lib/videoValidation.ts": "Deprecated video validation utilities for size, MIME type, and extension checks.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and renders the root component.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays all submissions with search, sorting, and error states, allowing admins to browse and filter student media submissions.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Checks admin permissions on load and conditionally redirects or shows an access‑denied message.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Provides UI for adjusting admin settings like CAPTCHA and upload limits, with most changes currently client‑side only.",
  "frontend/src/pages/admin/AuditLogPage.tsx": "Shows audit log filters and a placeholder log table, using client-side filtering while backend logging is unimplemented.",
  "frontend/src/pages/admin/SubmissionDetailsPage.tsx": "Loads and displays detailed information for a single submission, including media playback and deletion controls.",
  "frontend/src/pages/StudentUploadPage.tsx": "Student upload form enabling audio file upload or recording, validation, backend submission, and progress tracking.",
  "frontend/src/pages/SubmissionSuccessPage.tsx": "Displays a simple success message after a submission completes.",
  "frontend/src/types/lamejs.d.ts": "Defines global TypeScript types for the lamejs MP3 encoder loaded via CDN.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Project state file describing canister ID mismatch issues, required fixes, and feature requests for centralizing backend canister configuration."
}