{
  "backend/main.mo": "Motoko backend defining submission types, access control, session management, and storage handling for audio/video submissions. Includes admin session validation and helpers for username formatting and text processing.",
  "feature_evidence.json": "Feature‑evidence report mapping feature IDs to the frontend files implementing them, including MP3 conversion, upload flow rules, and related metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files, including recording, validation, routing, admin tools, and submission handling.",
  "frontend/FFMPEG_SETUP.md": "Documentation stub describing required dependencies for setting up FFmpeg.wasm in the frontend.",
  "frontend/index.css": "Tailwind CSS base/theme definitions including light and dark mode design tokens and global styling.",
  "frontend/index.html": "HTML entry point for the frontend application loading the root React component and favicon.",
  "frontend/README.md": "Frontend overview covering features, security, architecture, and admin authentication workflow for the AudioDrop application.",
  "frontend/src/App.tsx": "Defines the application router, including public and admin routes with guards, wrapped in theme and layout providers.",
  "frontend/src/components/admin/AdminAudioDownloadButton.tsx": "Downloads an audio blob by fetching bytes, creating a WebM blob, and triggering a download with status feedback.",
  "frontend/src/components/admin/AdminAudioPlayer.tsx": "Streams and plays an audio blob using its direct URL with loading and error states.",
  "frontend/src/components/admin/AdminMediaDownloadButton.tsx": "Downloads audio or video blobs based on media type, building the correct MIME blob and triggering download.",
  "frontend/src/components/admin/AdminSubmissionDownloadButton.tsx": "Triggers a backend submission download using an actor and reports success or errors with toasts.",
  "frontend/src/components/admin/AdminVideoPlayer.tsx": "Streams and plays a video blob using its direct URL with loading and error handling.",
  "frontend/src/components/admin/DeleteSubmissionButton.tsx": "Shows a confirmation dialog and deletes a submission via mutation, then redirects and reports status.",
  "frontend/src/components/admin/ExportTools.tsx": "UI component providing CSV export for submissions and a placeholder ZIP export action.",
  "frontend/src/components/AdminRouteGuard.tsx": "Component that checks admin authentication state and either renders children or displays an access‑denied prompt with navigation options.",
  "frontend/src/components/AppShell.tsx": "Layouts the app with header, footer, and navigation, handling admin session state and hiding chrome on the success page.",
  "frontend/src/components/AudioRecorder.tsx": "Provides in-browser audio recording with pause, stop, MP3 conversion, and error handling before returning the file.",
  "frontend/src/components/LocalCaptchaChallenge.tsx": "Implements a simple math CAPTCHA requiring correct input before continuing, with regeneration and error display.",
  "frontend/src/dev/ffmpegSmoke.ts": "Development utilities to test FFmpeg.wasm MP3 conversion using a blob or recorded audio.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAudioRecorder.ts": "Custom hook wrapping MediaRecorder to manage audio recording, timing, errors, and resulting blob data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity auth state, login flow, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles and submissions using the authenticated backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining global theme variables and light/dark mode color tokens.",
  "frontend/src/lib/adminApi.ts": "Provides admin login, logout, and session-check helpers using a backend actor with client-side session storage.",
  "frontend/src/lib/adminAuth.ts": "Empty placeholder file for admin auth utilities.",
  "frontend/src/lib/adminDownloads.ts": "Implements admin-only submission file downloads, handling permission errors and triggering browser downloads.",
  "frontend/src/lib/adminSession.ts": "Empty placeholder file for admin session utilities.",
  "frontend/src/lib/audioValidation.ts": "Validates audio files by size, extension, and MIME type, and includes formatting helpers for size and duration.",
  "frontend/src/lib/csrf.ts": "Placeholder CSRF token utilities storing tokens in sessionStorage and attaching them to headers.",
  "frontend/src/lib/downloads.ts": "Provides helpers to trigger file downloads from blobs or URLs in the browser.",
  "frontend/src/lib/ffmpeg/convertToMp3.ts": "Loads FFmpeg.wasm on demand and converts audio blobs to MP3 format using a singleton FFmpeg instance.",
  "frontend/src/lib/mediaMime.ts": "Maps between MIME types and extensions and infers or normalizes MIME types from filenames or backend data.",
  "frontend/src/lib/safeText.ts": "Provides basic text sanitization, truncation, and HTML escaping utilities.",
  "frontend/src/lib/submissionFormat.ts": "Formats timestamps, file sizes, durations, and submission IDs for display.",
  "frontend/src/lib/videoValidation.ts": "Validates video files by size, MIME type, and extension; primarily deprecated for public uploads.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard listing submissions with search, sorting, error states, and download/export tools.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Admin login form handling credential submission, validation, and navigation on success.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Admin UI for modifying CAPTCHA, rate limits, and upload size settings, currently stored client-side.",
  "frontend/src/pages/admin/AuditLogPage.tsx": "Audit log viewer with client‑side filtering; displays placeholder data pending backend implementation.",
  "frontend/src/pages/admin/SubmissionDetailsPage.tsx": "Admin page that loads a submission by ID, displays metadata and media player, and provides download and delete actions.",
  "frontend/src/pages/StudentUploadPage.tsx": "Form page for students to upload or record audio, validate inputs, handle CAPTCHA, and submit via API.",
  "frontend/src/pages/SubmissionSuccessPage.tsx": "Simple confirmation page showing successful submission message.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session-based parameters, including hash-based query parsing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, container settings, animations, and plugins.",
  "project_state.json": "Project state file describing MP3 conversion requirements, existing features, and pending requests."
}