{
  "backend/main.mo": "Motoko canister handling submission storage, user profiles, access control, and media blob integration with role-based authorization checks.",
  "feature_evidence.json": "Empty feature evidence report structure containing no listed features.",
  "frontend-file-summaries.txt": "Text file providing short summaries of key frontend source files and their roles.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes with global base styles.",
  "frontend/index.html": "Base HTML document loading the React app root and main entry script.",
  "frontend/README.md": "Project overview describing features, admin credentials, tech stack, and structure of the AudioDrop frontend.",
  "frontend/src/App.tsx": "Configures TanStack Router with public and admin routes wrapped in theme provider and AppShell.",
  "frontend/src/components/admin/AdminAudioDownloadButton.tsx": "Allows admins to download an audio ExternalBlob as a .webm file with loading and toast feedback.",
  "frontend/src/components/admin/AdminAudioPlayer.tsx": "Streams and plays an audio ExternalBlob via a direct URL with loading and error states.",
  "frontend/src/components/admin/AdminMediaDownloadButton.tsx": "Downloads audio or video ExternalBlob files based on media type, generating appropriate MIME types and filenames.",
  "frontend/src/components/admin/AdminVideoPlayer.tsx": "Streams and displays a video ExternalBlob with loading and error handling.",
  "frontend/src/components/admin/DeleteSubmissionButton.tsx": "Shows a confirmation dialog and deletes a submission via mutation, navigating back on success.",
  "frontend/src/components/admin/ExportTools.tsx": "Exports submission metadata to CSV client-side and provides a placeholder for ZIP media export.",
  "frontend/src/components/AdminRouteGuard.tsx": "Route guard verifying admin session and showing access denied UI or the protected content.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper with header, navigation, footer, and admin session-aware controls.",
  "frontend/src/components/AudioRecorder.tsx": "Provides an in-browser audio recorder with start, pause, resume, stop, and attach features, enforcing max duration and returning a File on completion.",
  "frontend/src/components/LocalCaptchaChallenge.tsx": "Renders a simple math-based CAPTCHA requiring users to solve an addition problem before continuing.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAudioRecorder.ts": "React hook managing audio recording with MediaRecorder, including start/stop/pause and timers, returning the recorded Blob and state flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for Internet Identity authentication using AuthClient, handling login status, stored identities, and provider setup.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for user profiles, submissions, and admin session/login actions.",
  "frontend/src/index.css": "TailwindCSS base styles with custom CSS variables for light and dark themes.",
  "frontend/src/lib/adminApi.ts": "Client-side admin auth utilities using hardcoded credentials with sessionStorage-based session management.",
  "frontend/src/lib/adminAuth.ts": "Empty placeholder file.",
  "frontend/src/lib/adminSession.ts": "Empty placeholder file.",
  "frontend/src/lib/audioValidation.ts": "Utilities for validating audio files, size limits, allowed formats, and formatting durations and file sizes.",
  "frontend/src/lib/csrf.ts": "SessionStorage-based placeholder CSRF token storage and header attachment helpers.",
  "frontend/src/lib/downloads.ts": "Helpers to trigger file downloads from blobs or URLs using temporary anchor elements.",
  "frontend/src/lib/safeText.ts": "Text sanitization helpers for stripping HTML, truncating, and escaping strings.",
  "frontend/src/lib/submissionFormat.ts": "Functions for formatting timestamps, sizes, durations, and generating or displaying submission IDs.",
  "frontend/src/lib/videoValidation.ts": "Provides deprecated video file validation utilities including size, MIME type, and extension checks.",
  "frontend/src/main.tsx": "Bootstraps the React app root with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays and filters all submissions for admins, including search, sorting, and export tools.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Provides the admin authentication form and handles login logic.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "UI for viewing and editing admin-configurable settings like CAPTCHA and upload limits.",
  "frontend/src/pages/admin/AuditLogPage.tsx": "Shows audit log filters and placeholder table for tracking admin actions, pending backend support.",
  "frontend/src/pages/admin/SubmissionDetailsPage.tsx": "Admin page that loads a submission by ID, shows student and media details, and provides media playback, download, and deletion actions.",
  "frontend/src/pages/StudentUploadPage.tsx": "Implements the student audio submission form with validation, CAPTCHA flow, and upload handling.",
  "frontend/src/pages/SubmissionSuccessPage.tsx": "Displays a confirmation screen after a successful submission.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, storing them in sessionStorage, and clearing them from the URL or storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, radius, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON metadata describing project state, architecture notes, known issues, and existing feature definitions."
}