{
  "kind": "build_request",
  "title": "Fix deployed app showing “Backend Offline” by initializing IC actor from generated declarations and gating submit on health check",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update frontend backend-actor initialization to always use the generated canister declarations import (no dynamic require/eval and no environment-variable canister ID lookup):\n- Import `idlFactory` and `canisterId` from `declarations/backend`\n- Create the `HttpAgent` with host `https://icp0.io` for deployed (and keep local replica host for dev)\n- Create the actor via `Actor.createActor(idlFactory, { agent, canisterId })`\n- Remove any environment-variable-based canister lookup and any dynamic `require`/`eval` canisterId resolution paths",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user"
        ],
        "quotes": [
          "Ensure actor is created using generated declarations:\n   import { Actor, HttpAgent } from \"@dfinity/agent\"\n   import { idlFactory, canisterId } from \"declarations/backend\"",
          "Do NOT hardcode canisterId.\n   Use the exported canisterId from declarations.",
          "Remove any environment-variable-based canister lookup."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/lib/icActor.ts` (and any other actor-creation code paths) imports `idlFactory` and `canisterId` from `declarations/backend` and does not read canister IDs from `import.meta.env`.",
        "The deployed frontend uses `https://icp0.io` as the agent host (local dev continues to use the local replica host).",
        "No code path hardcodes a canister ID string; only the `canisterId` export from `declarations/backend` is used.",
        "App no longer relies on `eval('require')` or similar runtime module loading to find `canisterId`."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure backend actor creation runs only after the browser window has loaded by wrapping actor initialization in an async init flow and gating all calls to `getBackendActor()` behind that initialization (e.g., wait for `window.load` before creating/caching the actor).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user"
        ],
        "quotes": [
          "Ensure this actor creation runs only after window loads.\n   Wrap in async init function."
        ]
      },
      "acceptanceCriteria": [
        "On a deployed build, actor creation does not run until after the `window` load event fires.",
        "Calls that need the actor (e.g., submission creation and health check) wait for initialization rather than receiving `undefined`/null actor values or failing due to premature initialization.",
        "No runtime errors occur on first page load related to actor initialization order."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add/confirm a lightweight backend health check runs on initial page load and drives the UI state:\n- On load, call a simple backend method (prefer `getVersion()` if available; otherwise `ping()` is acceptable)\n- If the call succeeds, allow submission (Submit enabled)\n- If the call fails, show the user-facing text \"Backend Offline\" and prevent submission attempts until healthy",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user"
        ],
        "quotes": [
          "Add a small health check on page load:\n   await actor.getVersion() or any simple method.\n   If success → enable Submit.\n   If fail → show \"Backend Offline\"."
        ]
      },
      "acceptanceCriteria": [
        "A health check is executed automatically when the student upload page loads (no manual user action required).",
        "When the health check succeeds, the Submit button can be used (assuming other form validations pass).",
        "When the health check fails, the UI shows exactly \"Backend Offline\" (English) and submission is blocked with a clear error.",
        "If `getVersion()` is used, the backend canister exposes it and it can be called as a simple health probe; otherwise `ping()` remains functional and used consistently."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the deployed user flow works end-to-end: `createSubmission` must succeed on the deployed site using the initialized actor from declarations, and the \"Backend Offline\" banner must not appear when the backend is reachable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user"
        ],
        "quotes": [
          "Deliverable:\nSubmit works on deployed site.\nNo \"Backend Offline\" banner."
        ]
      },
      "acceptanceCriteria": [
        "On the deployed site, a healthy backend does not show the \"Backend Offline\" banner.",
        "On the deployed site, submitting a valid audio submission successfully calls `createSubmission` and reaches the success screen.",
        "No actor-related initialization errors occur in the browser console during the submission flow."
      ]
    }
  ],
  "constraints": [
    "Do not hardcode canister IDs anywhere; use only `canisterId` exported by `declarations/backend`.",
    "Remove environment-variable-based canister lookup for the backend canister ID.",
    "All user-facing text introduced/modified by this change must be in English.",
    "Do not edit files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or `frontend/src/components/ui`."
  ],
  "nonGoals": [
    "Adding new authentication providers (only Internet Identity is supported).",
    "Introducing external databases or non-IC hosting/deployment changes.",
    "Implementing real-time communication features (websockets/push)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}