{
  "kind": "build_request",
  "title": "Make student submission creation fully public by removing #user permission check",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-79",
      "text": "Update the Motoko backend so that the public student upload flow can create submissions without any authentication by removing the `AccessControl.hasPermission(..., #user)` requirement from `createSubmission()` (and any other submission-create entrypoints, if present), so unauthenticated callers do not hit an \"Unauthorized\" trap.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent-apply-fix"
        ],
        "quotes": [
          "yes apply fix",
          "Your backend still contains this line inside `createSubmission()`: `if (not (AccessControl.hasPermission(accessControlState, caller, #user))) { Runtime.trap(\"Unauthorized: Only authenticated users can create submissions\"); };`"
        ]
      },
      "acceptanceCriteria": [
        "From the public Student Upload page (without logging in), a valid submission succeeds and the frontend can navigate to the success page (i.e., no backend trap with \"Unauthorized: Only authenticated users can create submissions\").",
        "`backend/main.mo` no longer traps on `createSubmission()` due to missing `#user` permission.",
        "The caller principal can remain stored as `submittedBy = ?caller` (including anonymous principal) without causing failures."
      ]
    },
    {
      "id": "REQ-80",
      "text": "Preserve strict admin-only authorization checks for all admin and submission-access operations (list submissions, view submission details, media playback/download, delete submission, exports, settings, audit log). Non-admin callers must continue to be rejected for these operations.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent-apply-fix"
        ],
        "quotes": [
          "public uploads will always fail because students are not authenticated."
        ]
      },
      "acceptanceCriteria": [
        "Non-admin callers cannot call `getAllSubmissions()`, `getSubmission()`, `deleteSubmissionById()`, or `deleteSubmissionByStudentId()` successfully; these methods continue to reject non-admin callers.",
        "The change to make submission creation public does not make any admin-only data or media retrieval accessible to public callers."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with logic in `backend/main.mo`.",
    "Do not edit files under `frontend/immutablePaths`.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing or changing admin authentication, sessions, or credentials as part of this fix.",
    "Adding new media types, changing upload validation, or changing submission data model fields unrelated to removing the public submission authorization trap.",
    "UI redesign work beyond what is required to verify the submission now succeeds."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}