{
  "kind": "build_request",
  "title": "Fix frontend backend canister ID mismatch and centralize canister config",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the outdated backend canister ID currently hardcoded as \"bd3sg-teaaa-aaaaa-qaaba-cai\" with the CURRENT deployed backend canister ID from the project backend settings, and ensure this value is used for all Internet Computer backend actor creation and health checks.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Frontend is calling canister id \"bd3sg-teaaa-aaaaa-qaaba-cai\" and ICP returns canister_not_found.",
          "Find and replace the backend canister ID constant so it uses the CURRENT deployed backend canister ID (from project backend settings)."
        ]
      },
      "acceptanceCriteria": [
        "The hardcoded canister id \"bd3sg-teaaa-aaaaa-qaaba-cai\" no longer appears anywhere in the frontend source.",
        "The canister id used by actor creation and health checks matches the CURRENT deployed backend canister ID from project backend settings.",
        "App load health check succeeds without returning canister_not_found."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Create a single shared canister configuration source file (e.g., frontend/src/config/canisters.ts) that exports the active backend canister ID, and refactor all backend call sites (student submit flow, admin dashboard/submission flows, and health checks) to read the canister ID from this shared source (no duplicated constants).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Ensure ALL backend calls (student submit + admin dashboard) use the SAME canister ID from a single source file (e.g., src/config/canisters.ts)."
        ]
      },
      "acceptanceCriteria": [
        "A single config module exists that exports the active backend canister ID.",
        "frontend/src/ic/actor.ts uses the shared config module instead of a local CANISTER_ID constant.",
        "Any other actor creation path used by the app (including the path used by frontend/src/hooks/useActor.ts via its actor factory import) uses the same shared canister ID source.",
        "Student submission and admin dashboard data fetches use the same canister id (verified by code inspection and runtime banner)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove any stale/old backend canister IDs hardcoded elsewhere in the frontend so there are no conflicting canister IDs in runtime code paths (including deprecated wrappers).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Remove any stale/old canister IDs hardcoded elsewhere."
        ]
      },
      "acceptanceCriteria": [
        "No frontend module contains a hardcoded backend canister ID other than the single shared config source.",
        "Deprecated helper modules (e.g., frontend/src/lib/icActor.ts) do not introduce a different canister id than the shared config."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a small, always-visible runtime banner in the UI that displays the active backend canister ID being used (read from the single shared config source) to allow verification without DevTools.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add a small banner showing the active canister id at runtime for verification."
        ]
      },
      "acceptanceCriteria": [
        "The UI displays a small banner showing the active backend canister ID at runtime.",
        "The banner’s value is sourced from the same shared canister config module used for actor creation.",
        "When the configured canister id is corrected, the banner shows the corrected value and backend calls succeed (no canister_not_found)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Verify end-to-end behavior: the initial health check, student submission, and admin dashboard/submission views perform backend calls successfully without any \"canister_not_found\" errors.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Deliverable:\nHealth check succeeds and submit works with no canister_not_found."
        ]
      },
      "acceptanceCriteria": [
        "On app load, the health check returns online/ok (no canister_not_found).",
        "Student submit completes successfully and reaches the success page without canister_not_found.",
        "Admin dashboard loads submissions (or returns a permission-related error if unauthorized) without canister_not_found."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep all Motoko logic in the single backend actor (backend/main.mo); only introduce a migration file if a stable state schema change is required (not expected for this fix)."
  ],
  "nonGoals": [
    "Do not add new authentication providers or change the Internet Identity integration.",
    "Do not change backend data models or submission logic beyond what is necessary to validate connectivity (the primary fix is frontend canister id configuration).",
    "Do not add localhost/dev replica support; this fix targets the currently deployed backend canister."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}