{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Centralize backend canister ID configuration and fix frontend canister ID mismatch",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the outdated hardcoded backend canister ID with the current deployed canister ID and ensure all actor creation and health checks use it.",
      "acceptanceCriteria": [
        "The hardcoded canister id \"bd3sg-teaaa-aaaaa-qaaba-cai\" no longer appears anywhere in the frontend source.",
        "The canister id used by actor creation and health checks matches the CURRENT deployed backend canister ID from project backend settings.",
        "App load health check succeeds without returning canister_not_found."
      ],
      "file_operations": [
        {
          "path": "frontend/src/ic/actor.ts",
          "operation": "modify",
          "description": "Remove the hardcoded CANISTER_ID value and instead read the active backend canister ID from the shared canister config module; ensure createBackendActor(), getAnonymousActor(), getCanisterId(), and checkHealth() all use the shared configured ID (matching the current deployed backend canister ID from project backend settings)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update initial app-load health check diagnostics (logging/toast description) to include the active backend canister ID from the shared canister config so mismatches can be identified quickly during runtime verification."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Create a single shared canister configuration module and refactor all backend call sites to use it (no duplicated constants).",
      "acceptanceCriteria": [
        "A single config module exists that exports the active backend canister ID.",
        "frontend/src/ic/actor.ts uses the shared config module instead of a local CANISTER_ID constant.",
        "Any other actor creation path used by the app (including the path used by frontend/src/hooks/useActor.ts via its actor factory import) uses the same shared canister ID source.",
        "Student submission and admin dashboard data fetches use the same canister id (verified by code inspection and runtime banner)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/canisters.ts",
          "operation": "create",
          "description": "Create a single shared canister configuration module that exports the active backend canister ID (set to the CURRENT deployed backend canister ID from project backend settings) and any small helpers needed by the UI/actor factory to read it consistently."
        },
        {
          "path": "frontend/src/ic/actor.ts",
          "operation": "modify",
          "description": "Import the backend canister ID from frontend/src/config/canisters.ts and use it as the single source of truth for actor creation and health checks; ensure the exported canister ID accessor is sourced from the shared config."
        },
        {
          "path": "frontend/src/components/RuntimeIcConfigDebug.tsx",
          "operation": "modify",
          "description": "Refactor the debug UI to read the backend canister ID from frontend/src/config/canisters.ts (not from ic/actor.ts) so the displayed value is guaranteed to match the single shared config source used for actor creation."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Remove stale/old backend canister IDs from the frontend to prevent conflicting runtime code paths.",
      "acceptanceCriteria": [
        "No frontend module contains a hardcoded backend canister ID other than the single shared canister config source.",
        "Deprecated helper modules (e.g., frontend/src/lib/icActor.ts) do not introduce a different canister id than the shared config."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/icActor.ts",
          "operation": "modify",
          "description": "Audit and update the deprecated wrapper to ensure it cannot introduce any canister ID constant or conflicting canister selection logic; keep it as a pure delegator to the shared actor factory that uses the shared canister config."
        },
        {
          "path": "frontend/src/components/RuntimeIcConfigDebug.tsx",
          "operation": "modify",
          "description": "Remove any remaining references that could indirectly rely on a hardcoded canister ID (e.g., via ic/actor getters) and ensure the displayed canister ID is always derived directly from the shared canister config module."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add an always-visible runtime banner showing the active backend canister ID sourced from the shared canister config.",
      "acceptanceCriteria": [
        "The UI displays a small banner showing the active backend canister ID at runtime.",
        "The banner’s value is sourced from the same shared canister config module used for actor creation.",
        "When the configured canister id is corrected, the banner shows the corrected value and backend calls succeed (no canister_not_found)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CanisterIdBanner.tsx",
          "operation": "create",
          "description": "Create a small, always-visible UI banner component that reads the active backend canister ID from frontend/src/config/canisters.ts and displays it in a compact, non-intrusive way suitable for runtime verification."
        },
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Wire the new CanisterIdBanner into the application layout so it is always visible across the app (including the success page layout that currently hides footer/header), ensuring the displayed ID matches the shared canister config source."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Verify end-to-end frontend behavior so health check, student submission, and admin dashboard views perform backend calls without canister_not_found.",
      "acceptanceCriteria": [
        "On app load, the health check returns online/ok (no canister_not_found).",
        "Student submit completes successfully and reaches the success page without canister_not_found.",
        "Admin dashboard loads submissions (or returns a permission-related error if unauthorized) without canister_not_found."
      ],
      "file_operations": [
        {
          "path": "frontend/src/ic/actor.ts",
          "operation": "modify",
          "description": "Improve health-check error reporting to explicitly surface canister_not_found scenarios alongside the active canister ID from the shared canister config, so end-to-end verification clearly indicates whether failures are due to configuration mismatch."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add targeted handling for canister_not_found (and related agent/replica errors) in student submission and admin data-fetch flows to present a clear UI error message that includes the active canister ID (sourced from frontend/src/config/canisters.ts) for quick end-to-end verification."
        },
        {
          "path": "frontend/src/pages/StudentUploadPage.tsx",
          "operation": "modify",
          "description": "Ensure any surfaced backend connectivity errors during submission (including canister_not_found) are shown in a user-visible way and align with the shared canister ID banner for end-to-end verification."
        }
      ]
    }
  ]
}