{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix deployed “Backend Offline” by using generated declarations actor init and load-gated health check",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Initialize backend actor using generated declarations import with correct deployed host and no env/dynamic canister ID resolution.",
      "acceptanceCriteria": [
        "`frontend/src/lib/icActor.ts` (and any other actor-creation code paths) imports `idlFactory` and `canisterId` from `declarations/backend` and does not read canister IDs from `import.meta.env`.",
        "The deployed frontend uses `https://icp0.io` as the agent host (local dev continues to use the local replica host).",
        "No code path hardcodes a canister ID string; only the `canisterId` export from `declarations/backend` is used.",
        "App no longer relies on `eval('require')` or similar runtime module loading to find `canisterId`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/icActor.ts",
          "operation": "modify",
          "description": "Replace canister-id resolution (remove eval/require and all import.meta.env lookups) by statically importing `idlFactory` and `canisterId` from `declarations/backend`; update agent host selection to use local replica host in dev and `https://icp0.io` when deployed; create the actor via `Actor.createActor(idlFactory, { agent, canisterId })` with no hardcoded IDs."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Align any direct actor creation/calls used for student submission and health probing to rely solely on `getBackendActor()` from `frontend/src/lib/icActor.ts` after it is updated to use generated declarations, ensuring no alternate canister ID resolution paths remain."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Defer actor creation until after window load and ensure all backend calls await the initialization flow.",
      "acceptanceCriteria": [
        "On a deployed build, actor creation does not run until after the `window` load event fires.",
        "Calls that need the actor (e.g., submission creation and health check) wait for initialization rather than receiving `undefined`/null actor values or failing due to premature initialization.",
        "No runtime errors occur on first page load related to actor initialization order."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/icActor.ts",
          "operation": "modify",
          "description": "Introduce an async initialization gate that waits for the browser `window` load event before creating/caching the actor; ensure `getBackendActor()` always awaits this init gate so all callers (health checks and submission creation) are safely sequenced."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Run a lightweight health check on student upload page load and gate submission/UI state on the result, showing “Backend Offline” on failure.",
      "acceptanceCriteria": [
        "A health check is executed automatically when the student upload page loads (no manual user action required).",
        "When the health check succeeds, the Submit button can be used (assuming other form validations pass).",
        "When the health check fails, the UI shows exactly \"Backend Offline\" (English) and submission is blocked with a clear error.",
        "If `getVersion()` is used, the backend canister exposes it and it can be called as a simple health probe; otherwise `ping()` remains functional and used consistently."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the `useBackendHealth` query to use a lightweight backend method as the probe (prefer `getVersion()` per available declarations) and to treat failures as unhealthy without throwing unhandled errors; ensure it awaits `getBackendActor()` (which is load-gated per REQ-2)."
        },
        {
          "path": "frontend/src/pages/StudentUploadPage.tsx",
          "operation": "modify",
          "description": "Ensure the health check runs on initial page load via the existing `useBackendHealth()` usage; gate form validity and submit attempts on a confirmed healthy state; update the offline banner text to exactly \"Backend Offline\" (matching capitalization) and update any offline toast/error text to English and consistent with the banner."
        },
        {
          "path": "frontend/src/lib/icActor.ts",
          "operation": "modify",
          "description": "Align any shared health-check helper (if used) to the same probe method chosen in `useBackendHealth` (prefer `getVersion()`), so health checks are consistent and do not rely on non-existent methods."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure deployed submission flow succeeds end-to-end using the declarations-based actor and no false “Backend Offline” banner when reachable.",
      "acceptanceCriteria": [
        "On the deployed site, a healthy backend does not show the \"Backend Offline\" banner.",
        "On the deployed site, submitting a valid audio submission successfully calls `createSubmission` and reaches the success screen.",
        "No actor-related initialization errors occur in the browser console during the submission flow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StudentUploadPage.tsx",
          "operation": "modify",
          "description": "Tighten submission gating so submit is disabled until the health check has succeeded, and ensure the submit handler blocks attempts when unhealthy with a clear English error; keep navigation to the success screen on successful `createSubmission` mutation."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure `useCreateSubmission` relies on the updated `getBackendActor()` (declarations-based, load-gated) and surfaces actor/connection failures with clear English errors suitable for the student submission flow."
        },
        {
          "path": "frontend/src/lib/icActor.ts",
          "operation": "modify",
          "description": "Harden actor initialization error messages and caching behavior for the anonymous (student) flow so deployed builds consistently use the declarations-based canisterId and the correct agent host, preventing spurious offline states when the backend is reachable."
        }
      ]
    }
  ]
}