{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Student Upload: allow audio or video submissions + admin video handling",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Update Student Upload UI/validation to allow either audio or video (at least one), and update English text accordingly.",
      "acceptanceCriteria": [
        "The form provides a clear choice between submitting Audio or Video (or two separate upload inputs with validation enforcing at least one).",
        "The submit button is enabled only when required metadata fields are filled, consent is checked, CAPTCHA (if enabled) is passed, and at least one of {audioFile, videoFile} is present.",
        "User-facing text is updated to reflect that audio is not mandatory if a video is uploaded (English only).",
        "If a user selects an invalid file type for the chosen media, an accessible validation message is shown and submission is blocked."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StudentUploadPage.tsx",
          "operation": "modify",
          "description": "Add a clear media submission choice (audio vs video) and update form validation to require at least one of {audioFile, videoFile}. Update all user-facing copy to reflect audio is optional when a video is uploaded (English only), ensure validation errors are accessible, and ensure CAPTCHA/consent/required fields gating still applies. Use the blob-storage ExternalBlob to upload the chosen media bytes with progress (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/AudioRecorder.tsx",
          "operation": "modify",
          "description": "Adjust AudioRecorder presentation/labels so it remains compatible with an audio-or-video flow (e.g., clarify audio recording is only needed if submitting audio), without changing recording behavior."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Add client-side video file validation (types + 25MB) and show accepted formats/max size near the video input.",
      "acceptanceCriteria": [
        "Video validation rejects files larger than 25MB with a clear error message.",
        "Video validation rejects unsupported formats with a clear error message.",
        "Audio validation continues to work unchanged for audio submissions.",
        "The UI shows the accepted video formats and max size near the video file input."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/videoValidation.ts",
          "operation": "create",
          "description": "Implement video validation helpers similar to existing audioValidation: allowed extensions/MIME types and a 25MB max size constant, returning clear error messages suitable for display in the Student Upload form."
        },
        {
          "path": "frontend/src/pages/StudentUploadPage.tsx",
          "operation": "modify",
          "description": "Wire the new video validation into the video file input, keep existing audio validation unchanged, and display accepted video formats and the 25MB limit near the video input."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Update submission mutation and Student Upload submission call to send the correct media payload and mediaType (audio or video) while preserving upload progress UI.",
      "acceptanceCriteria": [
        "When a video file is uploaded, the frontend sends video bytes to the backend submission API and does not require an audio file.",
        "When an audio file is uploaded/recorded, the frontend sends audio bytes to the backend submission API (current behavior preserved).",
        "Upload progress UI continues to function for both audio and video uploads."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update useCreateSubmission to accept a generic media ExternalBlob plus a MediaType value, and call the backend createSubmission with the correct arguments. Use the blob-storage ExternalBlob progress tracking consistently for both audio and video (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/pages/StudentUploadPage.tsx",
          "operation": "modify",
          "description": "Update submit handler to construct an ExternalBlob from the selected audio OR video file bytes (with upload progress), pass the correct mediaType, and ensure audio is not required when video is present. Use the blob-storage ExternalBlob to represent and upload the chosen media (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Update Admin submission details view to support video submissions with appropriate playback or messaging + download, while preserving audio behavior and protected media access.",
      "acceptanceCriteria": [
        "For audio submissions, the existing AdminAudioPlayer and audio download behavior continues to work.",
        "For video submissions, the details page does not attempt to use the audio player; it provides a video playback UI or, at minimum, a clear message indicating it is a video submission plus a download button.",
        "Download filename/extension is appropriate for the stored media type.",
        "All admin media access remains protected via backend calls (no public bucket links)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminVideoPlayer.tsx",
          "operation": "create",
          "description": "Create an admin video playback component that uses an ExternalBlob direct streaming URL for playback with loading/error states. Use blob-storage ExternalBlob.getDirectURL for streaming (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/admin/AdminMediaDownloadButton.tsx",
          "operation": "create",
          "description": "Create a media download button that fetches bytes from an ExternalBlob and downloads using a MIME type and filename appropriate to mediaType (audio vs video). Use blob-storage ExternalBlob.getBytes to retrieve data (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/pages/admin/SubmissionDetailsPage.tsx",
          "operation": "modify",
          "description": "Update details rendering to branch by submission.mediaType: keep using AdminAudioPlayer for audio, use AdminVideoPlayer (or a clear video message) for video, and use a media-type-aware download button. Ensure the page uses the submission ExternalBlob field from the backend interface and does not expose any public bucket links; media should be accessed via backend-provided ExternalBlob capabilities (Verify the blob-storage component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/admin/AdminAudioDownloadButton.tsx",
          "operation": "modify",
          "description": "Preserve current audio download behavior by either delegating to the new AdminMediaDownloadButton for audio or keeping current logic while aligning naming/props expectations with the updated details page."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Update admin dashboard user-facing copy to reflect that submissions may be audio or video (English only), without changing admin route protection."
        }
      ]
    }
  ]
}